Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00-S1/svd/PIC32CK0512SG00100S1.svd
            <register>
               <name>LEVELB</name>
               <description>Level B</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x11111111</resetValue>
               <fields>
                  <field>
                     <name>LEVEL8</name>
                     <description>Level 8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL8Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL9</name>
                     <description>Level 9</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL9Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL10</name>
                     <description>Level 10</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL10Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL11</name>
                     <description>Level 11</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL11Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL12</name>
                     <description>Level 12</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL12Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL13</name>
                     <description>Level 13</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL13Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL14</name>
                     <description>Level 14</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL14Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL15</name>
                     <description>Level 15</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL15Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
